УТ_для_edt/src/Documents/смартIECHOСпецификация/смартIECHOСпецификация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартIECHOСпецификация</name>
  <comment>//смарт:ММ #092 389 06.01.2021</comment>
  <posting>Deny</posting>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОборудования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Итого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоРуб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <comment>// 17.01.2021</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>СкидкаНаЗакупку</name>
    <comment>// 17.01.2021</comment>
    <type>
      <types>CatalogRef.смартIECHOСкидкиНаЗакупку</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоДляКлиента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <comment>// 22.04.2021</comment>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>Маржа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДействияКП</name>
    <comment>// 22.04.2021</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПоставкиДней</name>
    <comment>// 22.04.2021</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставкиДоГраницыРФ</name>
    <comment>// 22.04.2021</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьТаможенногоОформления</name>
    <comment>// 22.04.2021</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставкиПоРФ</name>
    <comment>// 22.04.2021</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СебестоимостьОборудования</name>
    <comment>// 22.04.2021</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоДляКлиентаРуб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоЦенаЗакупкиСоСкидкой</name>
    <comment>// 12.05.2021</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаржаUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Рентабельность</name>
    <comment>#1326 смарт: Лопато 20.03.2023 //Расчет маржи в спецификациях iECHO</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставкиЖДТранспортом</name>
    <comment>//++ #1376 смарт: Фролов 18.06.2023 //доработка функционала консруктора iECHO (Глобализация параметров)  </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставкиАМТранспортом</name>
    <comment>//++ #1376 смарт: Фролов 18.06.2023 //доработка функционала консруктора iECHO (Глобализация параметров)  </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаУчета</name>
    <comment>//++ #1376 смарт: Фролов 18.06.2023 //доработка функционала консруктора iECHO (Глобализация параметров)  </comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <comment>//++ #1376 смарт: Фролов 18.06.2023 //доработка функционала консруктора iECHO (Глобализация параметров)  </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СхемаЗаполненияСтоимости</name>
    <comment>//++ #1376 смарт: Фролов 18.06.2023 //доработка функционала консруктора iECHO (Глобализация параметров)  </comment>
    <type>
      <types>CatalogRef.смартiECHOЗаполнениеСтоимости</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДоставки</name>
    <type>
      <types>EnumRef.смартТипыДоставки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>НаименованиеКомплектующей</name>
      <type>
        <types>CatalogRef.смартIECHOКомплектующие</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/Enums/смартТипыДоставки/смартТипыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартТипыДоставки</name>
  <comment>//++ #1376 смарт: Фролов 18.06.2023 //доработка функционала консруктора iECHO (Глобализация параметров)  </comment>
  <enumValues>
    <name>МорскойПлюсЖД</name>
  </enumValues>
  <enumValues>
    <name>ЖелезнодорожныйТранспорт</name>
  </enumValues>
  <enumValues>
    <name>АвтомобильныйТранспорт</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/смартIECHOСпецификацияПрисоединенныеФайлы/смартIECHOСпецификацияПрисоединенныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартIECHOСпецификацияПрисоединенныеФайлы</name>
  <comment>//смарт:ММ #092 389 16.01.2021</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Автор</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <type>
      <types>DocumentRef.смартIECHOСпецификация</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаема</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификацииУниверсальная</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Дата добавления файла в базу</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Зашифрован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <comment>Индекс иконки, соответствующей расширению файла, для показа в списке</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <comment>Описание файла</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <comment>Дополнительный путь к файлу на диске (в случае если ТипХраненияФайла - на диске)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <comment>Размер файла</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Редактирует</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИзвлеченияТекста</name>
    <type>
      <types>EnumRef.СтатусыИзвлеченияТекстаФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <comment>Текст, извлеченный из файла - для полнотекстового поиска</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипХраненияФайла</name>
    <comment>Где хранятся файлы - в базе как ХранилищеЗначения или в каталоге на диске</comment>
    <type>
      <types>EnumRef.ТипыХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>Том</name>
    <comment>Ссылка на том (в случае если ТипХраненияФайла - на диске)</comment>
    <type>
      <types>CatalogRef.ТомаХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлХранилище</name>
    <comment>Служебное поле для обмена файлами в РИБ</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьВерсии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьЭлектронныеПодписи</name>
    <attributes>
      <name>ДатаПодписи</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайлаПодписи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>260</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КомуВыданСертификат</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Отпечаток</name>
      <comment>Отпечаток сертификата</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>УстановившийПодпись</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <comment>Двоичные данные сертификата</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроверкиПодписи</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодписьВерна</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьСертификатыШифрования</name>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <comment>Двоичные данные сертификата</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Documents/смартIECHOСпецификация/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда 
		//++ #1376 смарт: Фролов 18.06.2023 //доработка функционала консруктора iECHO (Глобализация параметров)
		//Объект.Менеджер = ПараметрыСеанса.ТекущийПользователь;
		//Объект.Валюта = Справочники.Валюты.НайтиПоКоду("840"); // доллар
		//ПрочитатьКурс();
		//ПересчитатьСуммыВВалюте();
		//// ++ 22.04.2021
		//Настройка = Справочники.смартПредопределенныеЗначения.КоличествоДнейДействияКП;
		//КоличествоДней = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение(Настройка, Ложь);
		//Если ЗначениеЗаполнено(КоличествоДней) И ТипЗнч(КоличествоДней) = Тип("Число") Тогда			
		//	Объект.ДатаДействияКП = ТекущаяДата() + КоличествоДней * 86400;
		//КонецЕсли;		
		//
		//Настройка = Справочники.смартПредопределенныеЗначения.СрокПоставкиДней;
		//КоличествоДней = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение(Настройка, Ложь);
		//Если ЗначениеЗаполнено(КоличествоДней) И ТипЗнч(КоличествоДней) = Тип("Число") Тогда			
		//	Объект.СрокПоставкиДней = КоличествоДней;
		//КонецЕсли;
		//
		//СтоимостьДоставкиДоГраницыРФПредопределенное 	= Справочники.смартПредопределенныеЗначения.СтоимостьДоставкиДоГраницыРФ;
		//СтоимостьТаможенногоОформленияПредопределенное 	= Справочники.смартПредопределенныеЗначения.СтоимостьТаможенногоОформления;
		//СтоимостьДоставкиПоРФПредопределенное 			= Справочники.смартПредопределенныеЗначения.СтоимостьДоставкиПоРФ;
		//Маржа 											= Справочники.смартПредопределенныеЗначения.Маржа;
		//
		//Объект.СтоимостьДоставкиДоГраницыРФ 	= смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение(СтоимостьДоставкиДоГраницыРФПредопределенное, Ложь);
		//Объект.СтоимостьТаможенногоОформления 	= смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение(СтоимостьТаможенногоОформленияПредопределенное, Ложь);
		//Объект.СтоимостьДоставкиПоРФ 			= смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение(СтоимостьДоставкиПоРФПредопределенное, Ложь);
		//Объект.Маржа 							= смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение(Маржа, Ложь);   
		//-- #1376 смарт: Фролов 18.06.2023
		// --
	КонецЕсли;
	
	// ++ 16.01.2021
	НастроитьВидимостьДоступность();
	
	// ++ 16.05.2021
	КоэффициентРасчетаСебестоимости = ПолучитьКоэффициентРасчетаСС();
	// --
	
	//++ #Б-2106 смарт: Лопато 06.03.2025 //Доработка спецификации конструктора iECHO  
	Если Параметры.Ключ.Пустая() Тогда 

		Если ЗначениеЗаполнено(Объект.СхемаЗаполненияСтоимости) Тогда 

			ОбновитьСписокТиповДоставки(Истина);
			ЗаполнитьСтоимостьИзПредопределенныхНастроек();
			
		КонецЕсли;	
		
		КурсВалютыСтруктура = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.Валюта, ТекущаяДата());
		Объект.Курс = КурсВалютыСтруктура.Курс;
		
		РассчитатьСтоимость();
		
	КонецЕсли;
	//-- #Б-2106 смарт: Лопато 06.03.2025
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	//++#1326 смарт: Лопато 20.03.2023 //Расчет маржи в спецификациях iECHO  
	Если НЕ ЗначениеЗаполнено(Объект.Рентабельность) Тогда
		РассчитатьРентабельность();
	КонецЕсли;	
	//--#1326 смарт: Лопато 20.03.2023 
	
	//++ #1376 смарт: Фролов 06.09.2023 //доработка функционала консруктора iECHO (Глобализация параметров)  
	ОбновитьСписокТиповДоставки();
	//-- #1376 смарт: Фролов 06.09.2023
КонецПроцедуры

// ++ 23.01.2021
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("смартЗапись_ЗадачаИсполнителяIECHO");
КонецПроцедуры

&НаКлиенте
Процедура КурсПриИзменении(Элемент)
	
	// ++ 22.04.2021
	РассчитатьСтоимость();
	// --
	
	ПересчитатьСуммыВВалюте();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ПрочитатьКурс();
	ПересчитатьСуммыВВалюте();
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	ПрочитатьКурс();
	ПересчитатьСуммыВВалюте();
КонецПроцедуры

&НаКлиенте
Процедура КомплектующиеПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	РассчитатьСуммуИтого();
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектующиеПослеУдаления(Элемент)
	
	РассчитатьСуммуИтого();

КонецПроцедуры

&НаКлиенте
Процедура КомплектующиеКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Комплектующие.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ПересчитатьСтроку(ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектующиеЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Комплектующие.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ПересчитатьСтроку(ТекущиеДанные);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомплектующиеНаименованиеКомплектующейПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Комплектующие.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.Цена = ПолучитьЦенуКомплектующей(ТекущиеДанные.НаименованиеКомплектующей);
		ПересчитатьСтроку(ТекущиеДанные);
		
		ПроверитьДублиКомплектующих(ТекущиеДанные.НаименованиеКомплектующей);
		
		// ++ 16.05.2021		
		Если ЭтоОсновнаяКомлектующая(ТекущиеДанные.НаименованиеКомплектующей) Тогда
			РассчитатьСтоимость();	
		КонецЕсли;
		// --
	КонецЕсли;
	
КонецПроцедуры

// ++ 17.01.2021
&НаКлиенте
Процедура КоммерческоеПредложение(Команда)
	
	Если ПолучитьТекущиегоПользователя() <> Объект.Менеджер Тогда
		Оповещение = Новый ОписаниеОповещения("ВопросПередПечатьюКПЗавершение", ЭтотОбъект, );
		ТекстВопроса = НСтр("ru = 'Изменить менеджера в спецификации?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	Иначе
		КоммерческоеПредложениеПродолжение();
	КонецЕсли;
	
КонецПроцедуры

// ++ 17.01.2021
&НаКлиенте
Процедура ВопросПередПечатьюКПЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда	
		ИзменитьМенеджераВДокументе(Истина);
		КоммерческоеПредложениеПродолжение();
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("КП может формировать только менеджер спецификации");	
	КонецЕсли;
	
КонецПроцедуры

// ++ 17.01.2021
&НаКлиенте
Процедура КоммерческоеПредложениеПродолжение()
	
	ТабличныйДокумент = СформироватьКоммерческоеПредложениеНаСервере();
	ИмяМакета = "МакетКП";
	СинонимМакета = "Коммерческое предложение";
	
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИмяМакета);    
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
    КоллекцияПечатныхФорм[0].СинонимМакета = СинонимМакета;  
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтаФорма);
	
	// Добавление КП во вложенные файлы
	ДобавитьФайлВПрисоединенныеФайлы(ТабличныйДокумент);
	
	//++ #Б-2620 смарт: Лопато 12.03.2025 //Удалить Спецификации по IECHO из задач.  
	// Закомментировал код
	//// Запустить Бизнес-процесс
	//ЗапуститьБизнесПроцесс();
	//-- #Б-2620 смарт: Лопато 12.03.2025
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

//////////////////////////////////////////////////////////////////////////////

// ++ 16.01.2021
&НаСервере
Процедура НастроитьВидимостьДоступность()
	
	Элементы.Номенклатура.ТолькоПросмотр = НЕ РольДоступна("ПолныеПрава");
	//++ смарт:Белоусова 621 10.09.2021
	если не РольДоступна("ПолныеПрава") тогда
		элементы.ГруппаСуммы.Видимость = Ложь;
	КонецЕсли;
	//-- смарт:Белоусова 621 10.09.2021

	//++ смарт:ММ 621 23.09.2021
	ЕстьПолныеПрава = УправлениеДоступом.ЕстьРоль("ПолныеПрава");
	
	Если УправлениеДоступом.ЕстьРоль("смартIECHOДобавлениеИзменениеСпецификаций")
		ИЛИ ЕстьПолныеПрава Тогда
		Элементы.ГруппаРасчет.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.ГруппаРасчет.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	//++ #1376 смарт: Фролов 06.10.2023 //Доработка функционала консруктора iECHO (Глобализация параметров) 
	//Переработаны доступы и видимость
	Если УправлениеДоступом.ЕстьРоль("смартIECHOЗакупщикКомплектующих")
		ИЛИ ЕстьПолныеПрава ИЛИ УправлениеДоступом.ЕстьРоль("смартIECHOАдминистрирование") Тогда
		Элементы.ГруппаРасчетДоставки.ТолькоПросмотр = Ложь;
		Элементы.ПоказателиДляДоставки.Видимость=Истина;
	Иначе
		Элементы.ПоказателиДляДоставки.Видимость=Ложь;
		//-- #1376 смарт: Фролов 06.10.2023
	КонецЕсли;
	//-- смарт:ММ 23.09.2021
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтроку(ТекСтрока)
	
	ТекСтрока.Стоимость = ТекСтрока.Цена * ТекСтрока.Количество;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьКурс()
	
	КурсВалютыСтруктура = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.Валюта, Объект.Дата);
	Объект.Курс = КурсВалютыСтруктура.Курс;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммыВВалюте()
	
	Если НЕ ЗначениеЗаполнено(Объект.Валюта) Тогда
		Возврат;
	КонецЕсли;
	
	// ++ 12.05.2021
	//Объект.ИтогоРуб = Объект.Итого * Объект.Курс;
	Объект.ИтогоРуб = Объект.ИтогоЦенаЗакупкиСоСкидкой * Объект.Курс;
	
	// ++ 04.05.2021
	Объект.ИтогоДляКлиентаРуб = Объект.ИтогоДляКлиента * Объект.Курс;
	// --
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммуИтого()
	
	Объект.Итого = Объект.Комплектующие.Итог("Стоимость");
	ПересчитатьСуммыВВалюте();
	
	// ++ 04.05.2021 
	РассчитатьСтоимость();
	// --
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦенуКомплектующей(Комплектующая)
	
	Возврат Комплектующая.Цена;
	
КонецФункции

&НаСервере
Процедура ПроверитьДублиКомплектующих(НаименованиеКомплектующей)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Комплектующие.НаименованиеКомплектующей КАК НаименованиеКомплектующей,
	|	Комплектующие.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВТ_ТЧ
	|ИЗ
	|	&ТЧ КАК Комплектующие
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТЧ.НаименованиеКомплектующей КАК Наименование,
	|	КОЛИЧЕСТВО(ВТ_ТЧ.НомерСтроки) КАК Количество
	|ИЗ
	|	ВТ_ТЧ КАК ВТ_ТЧ
	|ГДЕ
	|	ВТ_ТЧ.НаименованиеКомплектующей = &НаименованиеКомплектующей
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТЧ.НаименованиеКомплектующей
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ВТ_ТЧ.НомерСтроки) > 1";
	
	Запрос.УстановитьПараметр("ТЧ", Объект.Комплектующие.Выгрузить());
	Запрос.УстановитьПараметр("НаименованиеКомплектующей", НаименованиеКомплектующей);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначения.СообщитьПользователю("Комплектующая " + Выборка.Наименование + " введена более одного раза (" + Выборка.Количество + ")");
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектующиеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Копирование Тогда
		ТекущиеДанные = Элементы.Комплектующие.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда			
			ПроверитьДублиКомплектующих(ТекущиеДанные.НаименованиеКомплектующей);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// ++ 17.01.2021
&НаСервере
Функция СформироватьКоммерческоеПредложениеНаСервере()
	
	Об = РеквизитФормыВЗначение("Объект");
	
	Возврат Об.СформироватьКоммерческоеПредложение();
	
КонецФункции

// ++ 17.01.2021
&НаСервере
Процедура ИзменитьМенеджераВДокументе(ЗаписатьДокумент = Ложь)
	
	Объект.Менеджер = ПараметрыСеанса.ТекущийПользователь;
	
	Если ЗаписатьДокумент Тогда
		ЭтаФорма.Записать();
	КонецЕсли;
	
КонецПроцедуры

// ++ 17.01.2021
&НаСервереБезКонтекста
Функция ПолучитьТекущиегоПользователя()
	Возврат ПараметрыСеанса.ТекущийПользователь;
КонецФункции

// ++ 17.01.2021
&НаСервере
Процедура ДобавитьФайлВПрисоединенныеФайлы(ТабДок)
	
	Расширение = "pdf";
	
	ИмяФайла = "КП." + Расширение;
	ПолныйПутьФайла = КаталогВременныхФайлов() + ИмяФайла;
	
	ТабДок.Записать(ПолныйПутьФайла, ТипФайлаТабличногоДокумента.PDF);
	ДвоичныеДанныеФайла = Новый ДвоичныеДанные(ПолныйПутьФайла);
	
	АдресДанныхФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла, Новый УникальныйИдентификатор);
	
	ПараметрыФайла = Новый Структура();
	
	Автор = Объект.Менеджер;
	
	ПараметрыФайла.Вставить("Автор",                          Автор);
	ПараметрыФайла.Вставить("ИмяБезРасширения",               "КП");
	ПараметрыФайла.Вставить("РасширениеБезТочки",             Расширение);
	ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное",    ТекущаяУниверсальнаяДата());
	ПараметрыФайла.Вставить("ВладелецФайлов",                 Объект.Ссылка);
	ПараметрыФайла.Вставить("АдресФайлаВоВременномХранилище", АдресДанныхФайла);

	УжеЗаписанныйФайл = Справочники.смартIECHOСпецификацияПрисоединенныеФайлы.НайтиПоНаименованию("КП", Истина);
	
	Попытка
		Если ЗначениеЗаполнено(УжеЗаписанныйФайл) Тогда
			РаботаСФайлами.ОбновитьФайл(УжеЗаписанныйФайл, ПараметрыФайла)
		Иначе		
			СозданныйФайл = РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, АдресДанныхФайла);		
		КонецЕсли;
	Исключение
		ОбщегоНазначения.СообщитьПользователю("Не удалось присоединить файл КП." + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;


	УдалитьИзВременногоХранилища(АдресДанныхФайла);
	УдалитьФайлы(ПолныйПутьФайла);
	
КонецПроцедуры

// ++ 18.01.2021
&НаКлиенте
Процедура ЗапуститьБизнесПроцесс()
	
	СуществующийБП = НайтиЗапущенныйБизнесПроцесс(Объект.Ссылка);
	
	Если ЗначениеЗаполнено(СуществующийБП) Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("СуществующийБП", СуществующийБП);
		
		СписокЗначенийОтветов = Новый СписокЗначений;
		СписокЗначенийОтветов.Добавить("Перезапустить");
		СписокЗначенийОтветов.Добавить("Продолжить существующий");
				
		Оповещение = Новый ОписаниеОповещения("ВопросПередПерезапускомБПЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ТекстВопроса = НСтр("ru = 'Уже существует запущенный бизнес-процесс по спецификации. Продолжить его или перезапустить заново?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, СписокЗначенийОтветов, , "Перезапустить");
		
	Иначе
		ЗапуститьБизнесПроцессНаСервере();
	КонецЕсли;
					
КонецПроцедуры

// ++ 18.01.2021
&НаКлиенте
Процедура ВопросПередПерезапускомБПЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = "Перезапустить" Тогда	
		ЗапуститьБизнесПроцессНаСервере(ДополнительныеПараметры.СуществующийБП);	
	ИначеЕсли Ответ = "Продолжить существующий" Тогда
		
	КонецЕсли;
	
КонецПроцедуры

// ++ 18.01.2021
&НаСервереБезКонтекста
Функция НайтиЗапущенныйБизнесПроцесс(Предмет)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	смартIECHOПродажа.Ссылка КАК Ссылка
	|ИЗ
	|	БизнесПроцесс.смартIECHOПродажа КАК смартIECHOПродажа
	|ГДЕ
	|	смартIECHOПродажа.Предмет = &Предмет
	|	И НЕ смартIECHOПродажа.Завершен
	|	И смартIECHOПродажа.Стартован";
	
	Запрос.УстановитьПараметр("Предмет", Предмет);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;	
	КонецЕсли;
	
	Возврат Неопределено;
		
КонецФункции

// ++ 18.01.2021
&НаСервере
Процедура ЗапуститьБизнесПроцессНаСервере(СуществующийБП = Неопределено)
	
	Если ЗначениеЗаполнено(СуществующийБП) Тогда
		смартОбщегоНазначения.ЗавершитьБизнесПроцессИЗадачи(СуществующийБП, "Завершен пользователем. По предмету создан новый бизнес-процесс");
	КонецЕсли;

	Процесс = БизнесПроцессы.смартIECHOПродажа.СоздатьБизнесПроцесс();
	Процесс.Дата         = ТекущаяДатаСеанса();
	Процесс.Предмет      = Объект.Ссылка;
	Процесс.Автор        = Объект.Менеджер;
	Процесс.Наименование = "Продажа по спецификации №" + Объект.Номер + " от " + Формат(Объект.Дата, "ДФ='dd.MM.yyyy ""г.""'");
	Процесс.Записать();
	Процесс.Старт();
	
КонецПроцедуры

// ++ 22.04.2021
&НаКлиенте
Процедура СтоимостьДоставкиДоГраницыРФПриИзменении(Элемент)

	РассчитатьСтоимость();
	
КонецПроцедуры

// ++ 22.04.2021
&НаКлиенте
Процедура СтоимостьТаможенногоОформленияПриИзменении(Элемент)

	РассчитатьСтоимость();
	
КонецПроцедуры

// ++ 22.04.2021
&НаКлиенте
Процедура СтоимостьДоставкиПоРФПриИзменении(Элемент)

	РассчитатьСтоимость();
	
КонецПроцедуры

// ++ 22.04.2021
&НаКлиенте
Процедура МаржаПриИзменении(Элемент)
	
	РассчитатьСтоимость();
	
КонецПроцедуры

//++ смарт:ММ 621 30.09.2021
&НаКлиенте
Процедура МаржаUSDПриИзменении(Элемент)
	
	РассчитатьСтоимость(Истина);
	
КонецПроцедуры //-- смарт:ММ 30.09.2021

// ++ 22.04.2021
&НаСервере
//++ смарт:ММ 621 30.09.2021
//Процедура РассчитатьСтоимость()
Процедура РассчитатьСтоимость(ИзмениласьМаржаUSD = Ложь)
//-- смарт:ММ 30.09.2021
	
	ИтогоДляКлиентаРасчет = "";
	//++ #1376 смарт: Фролов 18.06.2023 //доработка функционала консруктора iECHO (Глобализация параметров)
	Если НЕ ЗначениеЗаполнено(Объект.СхемаЗаполненияСтоимости) Тогда
		Итого = Объект.Итого;
		Маржа = Объект.Маржа;
		СтоимостьДоставкиДоГраницыРФ 	= Объект.СтоимостьДоставкиДоГраницыРФ;
		СтоимостьДоставкиПоРФ 			= Объект.СтоимостьДоставкиПоРФ;
		СтоимостьТаможенногоОформления 	= Объект.СтоимостьТаможенногоОформления;
		// ++ 12.05.2021
		Объект.ИтогоЦенаЗакупкиСоСкидкой = смартОбщегоНазначения.РассчитатьСуммуСоСкидкойНаЗакупку(Объект.СкидкаНаЗакупку, Итого);
		ИтогоЦенаЗакупкиСоСкидкой 		= Объект.ИтогоЦенаЗакупкиСоСкидкой;
		// ++ 16.05.2021
		КоэффициентРасчетаСебестоимости = ПолучитьКоэффициентРасчетаСС();
		// --
		
		// ++ 16.05.2021
		//ДоставкаПоРФиТаможняРубли = СтоимостьДоставкиПоРФ + СтоимостьТаможенногоОформления;
		ДоставкаПоРФиТаможняРубли = СтоимостьДоставкиПоРФ * КоэффициентРасчетаСебестоимости + СтоимостьТаможенногоОформления * КоэффициентРасчетаСебестоимости;
		// --
		
		Рубли = Справочники.Валюты.НайтиПоКоду("643");
		Доллары = Объект.Валюта;
		//Курс2 = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Доллары, ТекущаяДата());
		//КурсВалюты = Курс2.Курс;
		КурсВалюты = Объект.Курс;
		
		ДоставкаПоРФиТаможняДоллары = РаботаСКурсамиВалют.ПересчитатьВВалюту(ДоставкаПоРФиТаможняРубли, Рубли, Доллары, ТекущаяДата());
		
		// ++ 16.05.2021
		//Объект.СебестоимостьОборудования = (ИтогоЦенаЗакупкиСоСкидкой + СтоимостьДоставкиДоГраницыРФ) * 1.2 + ДоставкаПоРФиТаможняДоллары;
		Объект.СебестоимостьОборудования = (ИтогоЦенаЗакупкиСоСкидкой + СтоимостьДоставкиДоГраницыРФ * КоэффициентРасчетаСебестоимости) * 1.2 + ДоставкаПоРФиТаможняДоллары;
		// --
		
		ИтогоДляКлиентаРасчет = 
		"Себестоимость оборудования = (Цена закупки со скидкой + Доставка до границы РФ) * 1.2 (НДС) + (Доставка по РФ + Таможенное оформление) / Курс " + Объект.Валюта + "-RUB =" + Символы.ПС
		+ "(" + ИтогоЦенаЗакупкиСоСкидкой + " + " + СтоимостьДоставкиДоГраницыРФ + ") * 1.2 + (" + СтоимостьДоставкиПоРФ + " + " + СтоимостьТаможенногоОформления + ") / " + КурсВалюты + " = " + Объект.СебестоимостьОборудования;
		
		//++ смарт:ММ 621 30.09.2021 
		//Объект.ИтогоДляКлиента = Окр(Объект.СебестоимостьОборудования + Объект.СебестоимостьОборудования * Маржа / 100, 2);
	ИначеЕсли Объект.ТипДоставки=Перечисления.смартТипыДоставки.МорскойПлюсЖД Тогда
		КоэффициентНДСТекст=Объект.СтавкаНДС/100+1;
		Итого = Объект.Итого;
		Маржа = Объект.Маржа;
		СтоимостьДоставкиДоГраницыРФ 	= Объект.СтоимостьДоставкиДоГраницыРФ;
		СтоимостьДоставкиПоРФ 			= Объект.СтоимостьДоставкиПоРФ;
		СтоимостьТаможенногоОформления 	= Объект.СтоимостьТаможенногоОформления;
		Объект.ИтогоЦенаЗакупкиСоСкидкой = смартОбщегоНазначения.РассчитатьСуммуСоСкидкойНаЗакупку(Объект.СкидкаНаЗакупку, Итого);
		ИтогоЦенаЗакупкиСоСкидкой 		= Объект.ИтогоЦенаЗакупкиСоСкидкой;
		КоэффициентРасчетаСебестоимости = ПолучитьКоэффициентРасчетаСС();
		ДоставкаПоРФиТаможняРубли = СтоимостьДоставкиПоРФ * КоэффициентРасчетаСебестоимости + СтоимостьТаможенногоОформления * КоэффициентРасчетаСебестоимости;
		
		Рубли = Справочники.Валюты.НайтиПоКоду("643");
		Доллары = Объект.Валюта;
		КурсВалюты = Объект.Курс;
		
		ДоставкаПоРФиТаможняДоллары = РаботаСКурсамиВалют.ПересчитатьВВалюту(ДоставкаПоРФиТаможняРубли, Рубли, Доллары, ТекущаяДата());
		
		Объект.СебестоимостьОборудования = (ИтогоЦенаЗакупкиСоСкидкой + СтоимостьДоставкиДоГраницыРФ * КоэффициентРасчетаСебестоимости) * КоэффициентНДСТекст + ДоставкаПоРФиТаможняДоллары;
		
		ИтогоДляКлиентаРасчет = 
		"Себестоимость оборудования = (Цена закупки со скидкой + Доставка до границы РФ) * "+КоэффициентНДСТекст+" (НДС) + (Доставка по РФ + Таможенное оформление) / Курс " + Объект.Валюта + "-RUB =" + Символы.ПС
		+ "(" + ИтогоЦенаЗакупкиСоСкидкой + " + " + СтоимостьДоставкиДоГраницыРФ + ") * "+КоэффициентНДСТекст+" + (" + СтоимостьДоставкиПоРФ + " + " + СтоимостьТаможенногоОформления + ") / " + КурсВалюты + " = " + Объект.СебестоимостьОборудования;
	Иначе 
		Если Объект.ТипДоставки=Перечисления.смартТипыДоставки.ЖелезнодорожныйТранспорт Тогда
			СтоимостьДоставкиВВалютеУчета=Объект.СтоимостьДоставкиЖДТранспортом;
		Иначе
			СтоимостьДоставкиВВалютеУчета=Объект.СтоимостьДоставкиАМТранспортом;
		КонецЕсли;	
		
		КоэффициентНДСТекст=Объект.СтавкаНДС/100+1;
		Итого = Объект.Итого;
		Маржа = Объект.Маржа;
		СтоимостьТаможенногоОформления 	= Объект.СтоимостьТаможенногоОформления;
		Объект.ИтогоЦенаЗакупкиСоСкидкой = смартОбщегоНазначения.РассчитатьСуммуСоСкидкойНаЗакупку(Объект.СкидкаНаЗакупку, Итого);
		ИтогоЦенаЗакупкиСоСкидкой 		= Объект.ИтогоЦенаЗакупкиСоСкидкой;
		КоэффициентРасчетаСебестоимости = ПолучитьКоэффициентРасчетаСС();
		ДоставкаТаможняВВалютеУчета = СтоимостьТаможенногоОформления * КоэффициентРасчетаСебестоимости;
		
		Рубли = Справочники.Валюты.НайтиПоКоду("643");
		Доллары = Объект.Валюта;
		КурсВалюты = Объект.Курс;
		
		КурсВалютаУчетаСтруктура = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.ВалютаУчета, ТекущаяДата());
		КурсВалютаУчета=КурсВалютаУчетаСтруктура.Курс;
		КратностьКурса=КурсВалютаУчетаСтруктура.Кратность;
		КроссКурс=Формат(КурсВалюты/КурсВалютаУчета,"ЧЦ=10; ЧДЦ=4");  
		
		СтоимостьДоставкиДоллары= РаботаСКурсамиВалют.ПересчитатьВВалюту(СтоимостьДоставкиВВалютеУчета, Объект.ВалютаУчета, Доллары, ТекущаяДата());
		ТаможняДоллары = РаботаСКурсамиВалют.ПересчитатьВВалюту(ДоставкаТаможняВВалютеУчета, Объект.ВалютаУчета, Доллары, ТекущаяДата());
		Объект.СебестоимостьОборудования = (ИтогоЦенаЗакупкиСоСкидкой + СтоимостьДоставкиДоллары * КоэффициентРасчетаСебестоимости) * +КоэффициентНДСТекст + ТаможняДоллары;
		
		ИтогоДляКлиентаРасчет = 
		"Себестоимость оборудования = (Цена закупки со скидкой + "+Объект.ТипДоставки+" * "+КоэффициентНДСТекст+" (НДС) + Таможенное оформление) / Кросс курс "+Объект.Валюта+"-"+Объект.ВалютаУчета.Наименование+" * Кратность курса =" + Символы.ПС
		+ "(" + ИтогоЦенаЗакупкиСоСкидкой + " + " + СтоимостьДоставкиВВалютеУчета + ") * "+КоэффициентНДСТекст+" + (" + СтоимостьТаможенногоОформления + ") / " + КроссКурс + " * "+ КратностьКурса+ " = " + Объект.СебестоимостьОборудования;
	КонецЕсли;
	//-- #1376 смарт: Фролов 18.06.2023
	Если ИзмениласьМаржаUSD Тогда
		
		
		// Пересчитать процент
		Если Объект.СебестоимостьОборудования = 0 Тогда
			Объект.Маржа = 0;
		Иначе
			//++#1326 смарт: Лопато 20.03.2023 //Расчет маржи в спецификациях iECHO  
			//Объект.Маржа = Окр(Объект.МаржаUSD / Объект.СебестоимостьОборудования * 100, 3);
			Объект.Маржа = Окр(Объект.МаржаUSD / Объект.СебестоимостьОборудования * 100);
			//--#1326 смарт: Лопато 20.03.2023
		КонецЕсли;
		
		Маржа = Объект.Маржа;
		
	Иначе
	
		//++ смарт:Белоусова 621 09.09.21
		объект.МаржаUSD = Окр(Объект.СебестоимостьОборудования * Маржа / 100, 2); //Маржа в USD
		//-- смарт:Белоусова 621 09.09.21
	КонецЕсли;
	
	//++ #1518 смарт: Фролов 19.10.2023 //Изменения консруктора iECHO (продолжение задачи 1376)
	//Изменил разрядность округления
	Объект.ИтогоДляКлиента = Окр(Объект.СебестоимостьОборудования + Объект.МаржаUSD, -1);
	//-- #1518 смарт: Фролов 19.10.2023
	//-- смарт:ММ 30.09.2021	

	//++#1326 смарт: Лопато 20.03.2023 //Расчет маржи в спецификациях iECHO  
	РассчитатьРентабельность();	
	//--#1326 смарт: Лопато 20.03.2023
	
	ИтогоДляКлиентаРасчет = ИтогоДляКлиентаРасчет +  Символы.ПС
	+ "Цена для клиента = Себестоимость оборудования + Себестоимость оборудования * Маржа = " + Символы.ПС
	+ Объект.СебестоимостьОборудования + " + " + Объект.СебестоимостьОборудования + " * " + Маржа + "% = " + Объект.ИтогоДляКлиента;
	

	ПересчитатьСуммыВВалюте();
	
	//ОбщегоНазначения.СообщитьПользователю(ИтогоДляКлиентаРасчет);
	
КонецПроцедуры


//++ смарт:Белоусова 621 10.09.2021

//// ++ 22.04.2021
//&НаКлиенте
//Процедура ВключитьВозможностьРасчетаПриИзменении(Элемент)
//	Элементы.ГруппаРасчет.ТолькоПросмотр = НЕ ДоступностьРасчета;
//КонецПроцедуры

//-- смарт:Белоусова 621 10.09.2021

// ++ 04.05.2021
&НаКлиенте
Процедура ИтогоДляКлиентаПриИзменении(Элемент)

	//++#1326 смарт: Лопато 20.03.2023 //Расчет маржи в спецификациях iECHO  
	Объект.МаржаUSD = Окр(Объект.ИтогоДляКлиента - Объект.СебестоимостьОборудования, 2);  
	
	РассчитатьСтоимость(Истина);
	
	//ПересчитатьСуммыВВалюте();
	//--#1326 смарт: Лопато 20.03.2023
	
КонецПроцедуры

// ++ 12.05.2021
&НаКлиенте
Процедура СкидкаНаЗакупкуПриИзменении(Элемент)	
	
	РассчитатьСтоимость();
	
КонецПроцедуры

// ++ 12.05.2021
&НаКлиенте
Процедура ИтогоЦенаЗакупкиСоСкидкойПриИзменении(Элемент)
	
	РассчитатьСтоимость();
	
КонецПроцедуры

// ++ 16.05.2021
&НаСервереБезКонтекста
Функция ЭтоОсновнаяКомлектующая(Комплектующая)
	
	Возврат Комплектующая.ОсновнаяКомплектующая;
	
КонецФункции

// ++ 16.05.2021
&НаСервере
Функция ПолучитьКоэффициентРасчетаСС()
	Возврат Документы.смартIECHOСпецификация.ПолучитьКоэффициентРасчетаСС(Объект.Комплектующие.Выгрузить());
КонецФункции


//++ смарт:ММ 621 30.09.2021
&НаКлиенте
Процедура СортироватьПоПорядку(Команда)
	СортироватьПоПорядкуНаСервере();
КонецПроцедуры //-- смарт:ММ 30.09.2021

//++ смарт:ММ 621 30.09.2021 
&НаСервере
Процедура СортироватьПоПорядкуНаСервере()
	
	Об = РеквизитФормыВЗначение("Объект");
	Об.СортироватьТаблицуКомплектующих();
	ЗначениеВРеквизитФормы(Об, "Объект");
	
	Модифицированность = Истина;
	
КонецПроцедуры //-- смарт:ММ 30.09.2021

//++#1326 смарт: Лопато 20.03.2023 //Расчет маржи в спецификациях iECHO  
&НаСервере
Процедура РассчитатьРентабельность()

	Если Объект.ИтогоДляКлиента = 0 Тогда
		Рентабельность = 0;
	Иначе	
		Рентабельность = Окр(Объект.МаржаUSD / Объект.ИтогоДляКлиента * 100);
	КонецЕсли;
	
	Если Объект.Рентабельность <> Рентабельность Тогда
		Объект.Рентабельность = Рентабельность;
	КонецЕсли;	
		
КонецПроцедуры //--#1326 смарт: Лопато 20.03.2023

//++ #1376 смарт: Фролов 18.06.2023 //доработка функционала консруктора iECHO (Глобализация параметров)
&НаКлиенте
Процедура СтоимостьДоставкиЖДТранспортомПриИзменении(Элемент)
	РассчитатьСтоимость();
КонецПроцедуры //-- #1376 смарт: Фролов 18.06.2023

//++ #1376 смарт: Фролов 18.06.2023 //доработка функционала консруктора iECHO (Глобализация параметров)
&НаКлиенте
Процедура СтоимостьДоставкиАМТранспортомПриИзменении(Элемент)
	РассчитатьСтоимость();
КонецПроцедуры //-- #1376 смарт: Фролов 18.06.2023

&НаКлиенте
//++ #1376 смарт: Фролов 18.06.2023 //доработка функционала консруктора iECHO (Глобализация параметров)
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(Объект.СхемаЗаполненияСтоимости) Тогда 
		//++ #Б-1468 смарт: Фролов 06.12.2024 //IECHO Спецификация (смарт) ошибки в заполнении стоимости
		//РассчитатьСтоимость();
		//-- #Б-1468 смарт: Фролов 06.12.2024
	КонецЕсли;	
КонецПроцедуры //-- #1376 смарт: Фролов 06.09.2023

//++ #1376 смарт: Фролов 06.09.2023 //доработка функционала консруктора iECHO (Глобализация параметров)
&НаКлиенте
Процедура СхемаЗаполненияСтоимостиПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.СхемаЗаполненияСтоимости) Тогда 
		ОбновитьСписокТиповДоставки(Истина);
		ЗаполнитьСтоимостьИзПредопределенныхНастроек();
		РассчитатьСтоимость(); 
	КонецЕсли;	
КонецПроцедуры  //-- #1376 смарт: Фролов 06.09.2023

//++ #1376 смарт: Фролов 06.09.2023 //доработка функционала консруктора iECHO (Глобализация параметров)
&НаКлиенте
Процедура ТипДоставкиПриИзменении(Элемент)
	Объект.ТипДоставки=ТипДоставкиФорма;
	РассчитатьСтоимость();
КонецПроцедуры  //-- #1376 смарт: Фролов 06.09.2023  

&НаСервере
//++ #1376 смарт: Фролов 06.09.2023 //доработка функционала консруктора iECHO (Глобализация параметров)  
Процедура ОбновитьСписокТиповДоставки(СброситьТипДоставки=Ложь) 
	Элементы.ТипДоставкиФорма.СписокВыбора.Очистить();
	Если Объект.СхемаЗаполненияСтоимости.Страна=Справочники.СтраныМира.Россия ТОгда
		Элементы.ТипДоставкиФорма.СписокВыбора.Добавить(Перечисления.смартТипыДоставки.МорскойПлюсЖД,"Морской транспорт + ЖД"); 
		Элементы.ДекорацияВниманиеСтрана.Видимость=Ложь;
	КонецЕсли; 
	Если ЗначениеЗаполнено(Объект.СхемаЗаполненияСтоимости) ТОгда
		Страна=НРег(Объект.СхемаЗаполненияСтоимости.Страна.Наименование); 
		Страна=Врег(Лев(Страна,1))+Сред(Страна,2,СтрДлина(Страна)-1);
		МасДляСтраны=ПолучитьСклоненияСтроки(Страна,"ПЛ=Мужской","ПД=Родительный");
		НаименованиеСтраны=МасДляСтраны[0];
		Элементы.ДекорацияВниманиеСтрана.Заголовок="Внимание! Расчет произведен для "+НаименованиеСтраны+"";
		Элементы.ДекорацияВниманиеСтрана.Видимость=Истина;
	КонецЕсли;
	Элементы.ТипДоставкиФорма.СписокВыбора.Добавить(Перечисления.смартТипыДоставки.ЖелезнодорожныйТранспорт,"Железнодорожный транспорт");
	Элементы.ТипДоставкиФорма.СписокВыбора.Добавить(Перечисления.смартТипыДоставки.АвтомобильныйТранспорт,"Автомобильный транспорт"); 
	Если СброситьТипДоставки И ЗначениеЗаполнено(Объект.СхемаЗаполненияСтоимости) Тогда
		Объект.ТипДоставки=Объект.СхемаЗаполненияСтоимости.ТипДоставки;
	Конецесли;
	ТипДоставкиФорма=Объект.ТипДоставки;
КонецПроцедуры	//-- #1376 смарт: Фролов 06.09.2023

//++ #1376 смарт: Фролов 03.10.2023 //доработка функционала консруктора iECHO (Глобализация параметров)
&НаСервере
Процедура ЗаполнитьСтоимостьИзПредопределенныхНастроек()
	Объект.СтоимостьДоставкиДоГраницыРФ 	= Объект.СхемаЗаполненияСтоимости.СтоимостьДоставкиДоГраницыРФ;
	Объект.СтоимостьТаможенногоОформления 	= Объект.СхемаЗаполненияСтоимости.СтоимостьТаможенногоОформления;
	Объект.СтоимостьДоставкиПоРФ 			= Объект.СхемаЗаполненияСтоимости.СтоимостьДоставкиПоРФ;
	Объект.СтоимостьДоставкиЖДТранспортом  = Объект.СхемаЗаполненияСтоимости.СтоимостьДоставкиЖДТранспортом;
	Объект.СтоимостьДоставкиАМТранспортом  = Объект.СхемаЗаполненияСтоимости.СтоимостьДоставкиАМТранспортом;
	
	Объект.СтавкаНДС                       = Объект.СхемаЗаполненияСтоимости.СтавкаНДС;
	
	Объект.ВалютаУчета                     = Объект.СхемаЗаполненияСтоимости.ВалютаУчета;
	
	Объект.Маржа = Объект.СхемаЗаполненияСтоимости.Маржа;
	
	КоличествоДней = Объект.СхемаЗаполненияСтоимости.КоличествоДнейДействияКП;
	Если ЗначениеЗаполнено(КоличествоДней) И ТипЗнч(КоличествоДней) = Тип("Число") Тогда			
		Объект.ДатаДействияКП = ТекущаяДата() + КоличествоДней * 86400;
	КонецЕсли;		
	
	КоличествоДней = Объект.СхемаЗаполненияСтоимости.СрокПоставкиДней;
	Объект.СрокПоставкиДней = КоличествоДней;
КонецПроцедуры	//-- #1376 смарт: Фролов 03.10.2023
